 
في الواقع الكود ردئ جدا وربما كبداية مع بايثون وopencv
للتعرف علي السيارات 
حقيقة الكود بالأساس ليس ملكا لي وخاصة الملف الذي يحمل الوسوم cars3.xml

وربما يمكنني مساعدة شخص حتي يقف علي البداية 
هذا ما وصلت اليه حتي الان

ملاحظة هامه
العداد الكلي للسيارات غير صحيح
عدا المتغير kkll
فهو يحمل عدد السيارات الموجودة فعلا في الإطار
ان استعملت فيديو اخر قد لا تتمكن من استخدام الملف vvb.py حتي تقوم ببعض التعديلات الخاصة بمكان عرض الفيديو وغيره
ولكن مع الملف الاخر car001.py يمكنك تعديل الارتفاع والعرض الخاص بالفيديو الجديد
وبعيدا عن الاضافات المزعجة التي قمت بوضعها يمكنك تجربة الكود الموجود في car000.py
فهو لا يحوي اي تعديلات غير مرغوب بها
فقط التعرف علي السيارات ورسم المربع حولها وبعض التفاصيل عنها 
اسف للاطالة وشكرا


________
محمد عماد
